Este jupyter ha sido tomado del link 

https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html

# 10 Minutes to pandas

This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the [Cookbook](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Customarily, we import as follows:

In [1]:
import pandas as pd
import numpy as np

## Object Creation

See the [Data Structure Intro section](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dsintro)

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01 -0.214429 -0.940703 -0.140508  0.641434
2013-01-02 -1.347553  0.565707  0.411916 -1.451858
2013-01-03 -0.203716 -1.693033 -0.382789 -0.826806
2013-01-04  0.260699 -0.769324  1.209948 -1.239740
2013-01-05 -0.324262 -0.304008  0.282900 -0.749400
2013-01-06 -1.316322  0.286291 -0.295967 -0.746223

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [8]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D':np.array([3]*4,dtype='int32'),
                   'E':pd.Categorical(["test","train","test","train"]),
                   'F':'foo'})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Having specific [dtypes](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-dtypes)

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

See the [Basics section](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics)

See the top & bottom rows of the frame

In [12]:
df.head()

                   A         B         C         D
2013-01-01 -0.214429 -0.940703 -0.140508  0.641434
2013-01-02 -1.347553  0.565707  0.411916 -1.451858
2013-01-03 -0.203716 -1.693033 -0.382789 -0.826806
2013-01-04  0.260699 -0.769324  1.209948 -1.239740
2013-01-05 -0.324262 -0.304008  0.282900 -0.749400

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.260699 -0.769324  1.209948 -1.239740
2013-01-05 -0.324262 -0.304008  0.282900 -0.749400
2013-01-06 -1.316322  0.286291 -0.295967 -0.746223

Display the index, columns, and the underlying numpy data

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.values

array([[-0.21442908, -0.94070293, -0.14050808,  0.64143389],
       [-1.34755251,  0.56570737,  0.4119157 , -1.4518579 ],
       [-0.20371591, -1.69303317, -0.38278878, -0.82680604],
       [ 0.26069874, -0.76932446,  1.20994837, -1.23973973],
       [-0.32426167, -0.30400832,  0.2829002 , -0.74940021],
       [-1.31632189,  0.28629149, -0.29596701, -0.74622272]])

Describe shows a quick statistic summary of your data

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.524264 -0.475845  0.180917 -0.728765
std    0.657279  0.834144  0.595174  0.730992
min   -1.347553 -1.693033 -0.382789 -1.451858
25%   -1.068307 -0.897858 -0.257102 -1.136506
50%   -0.269345 -0.536666  0.071196 -0.788103
75%   -0.206394  0.138717  0.379662 -0.747017
max    0.260699  0.565707  1.209948  0.641434

Transposing your data

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.214429   -1.347553   -0.203716    0.260699   -0.324262   -1.316322
B   -0.940703    0.565707   -1.693033   -0.769324   -0.304008    0.286291
C   -0.140508    0.411916   -0.382789    1.209948    0.282900   -0.295967
D    0.641434   -1.451858   -0.826806   -1.239740   -0.749400   -0.746223

Sorting by an axis

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.641434 -0.140508 -0.940703 -0.214429
2013-01-02 -1.451858  0.411916  0.565707 -1.347553
2013-01-03 -0.826806 -0.382789 -1.693033 -0.203716
2013-01-04 -1.239740  1.209948 -0.769324  0.260699
2013-01-05 -0.749400  0.282900 -0.304008 -0.324262
2013-01-06 -0.746223 -0.295967  0.286291 -1.316322

Sorting by value

In [20]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -0.203716 -1.693033 -0.382789 -0.826806
2013-01-01 -0.214429 -0.940703 -0.140508  0.641434
2013-01-04  0.260699 -0.769324  1.209948 -1.239740
2013-01-05 -0.324262 -0.304008  0.282900 -0.749400
2013-01-06 -1.316322  0.286291 -0.295967 -0.746223
2013-01-02 -1.347553  0.565707  0.411916 -1.451858

## Selection

**Note:** While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.

See the indexing documentation [Indexing and Selecting Data](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) and [MultiIndex / Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

### Getting

Selecting a single column, which yields a Series, equivalent to df.A

In [21]:
df['A']

2013-01-01   -0.214429
2013-01-02   -1.347553
2013-01-03   -0.203716
2013-01-04    0.260699
2013-01-05   -0.324262
2013-01-06   -1.316322
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.214429 -0.940703 -0.140508  0.641434
2013-01-02 -1.347553  0.565707  0.411916 -1.451858
2013-01-03 -0.203716 -1.693033 -0.382789 -0.826806

In [23]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.347553  0.565707  0.411916 -1.451858
2013-01-03 -0.203716 -1.693033 -0.382789 -0.826806
2013-01-04  0.260699 -0.769324  1.209948 -1.239740

### Selection by Label

See more in [Selection by Label](Selection by Label)

For getting a cross section using a label

In [24]:
df.loc[dates[0]]

A   -0.214429
B   -0.940703
C   -0.140508
D    0.641434
Name: 2013-01-01 00:00:00, dtype: float64

Selection by Label

In [25]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.214429 -0.940703
2013-01-02 -1.347553  0.565707
2013-01-03 -0.203716 -1.693033
2013-01-04  0.260699 -0.769324
2013-01-05 -0.324262 -0.304008
2013-01-06 -1.316322  0.286291

Showing label slicing, both endpoints are included

In [26]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.347553  0.565707
2013-01-03 -0.203716 -1.693033
2013-01-04  0.260699 -0.769324

Reduction in the dimensions of the returned object

In [27]:
df.loc['20130102',['A','B']]

A   -1.347553
B    0.565707
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value

In [28]:
df.loc[dates[0],'A']

-0.21442907902527128

### Selection by Position

See more in [Selection by Position](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer)

Select via the position of the passed integers

In [29]:
df.iloc[3]

A    0.260699
B   -0.769324
C    1.209948
D   -1.239740
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

In [30]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.260699 -0.769324
2013-01-05 -0.324262 -0.304008

By lists of integer position locations, similar to the numpy/python style

In [32]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.347553  0.411916
2013-01-03 -0.203716 -0.382789
2013-01-05 -0.324262  0.282900

For slicing rows explicitly

In [33]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.347553  0.565707  0.411916 -1.451858
2013-01-03 -0.203716 -1.693033 -0.382789 -0.826806

For slicing columns explicitly

In [34]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.940703 -0.140508
2013-01-02  0.565707  0.411916
2013-01-03 -1.693033 -0.382789
2013-01-04 -0.769324  1.209948
2013-01-05 -0.304008  0.282900
2013-01-06  0.286291 -0.295967

For getting a value explicitly

In [35]:
df.iloc[1,1]

0.5657073715564663

For getting fast access to a scalar (equiv to the prior method)

In [36]:
df.iat[1,1]

0.5657073715564663

## Boolean Indexing

Using a single column’s values to select data.

In [37]:
df[df.A > 0]

                   A         B         C        D
2013-01-04  0.260699 -0.769324  1.209948 -1.23974

A where operation for getting.

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN  0.641434
2013-01-02       NaN  0.565707  0.411916       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04  0.260699       NaN  1.209948       NaN
2013-01-05       NaN       NaN  0.282900       NaN
2013-01-06       NaN  0.286291       NaN       NaN

Using the isin() method for filtering:

In [39]:
df2 = df.copy()

In [40]:
df2['E'] = ['one','one', 'two','three','four','three']

In [41]:
df2

                   A         B         C         D      E
2013-01-01 -0.214429 -0.940703 -0.140508  0.641434    one
2013-01-02 -1.347553  0.565707  0.411916 -1.451858    one
2013-01-03 -0.203716 -1.693033 -0.382789 -0.826806    two
2013-01-04  0.260699 -0.769324  1.209948 -1.239740  three
2013-01-05 -0.324262 -0.304008  0.282900 -0.749400   four
2013-01-06 -1.316322  0.286291 -0.295967 -0.746223  three

In [42]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.203716 -1.693033 -0.382789 -0.826806   two
2013-01-05 -0.324262 -0.304008  0.282900 -0.749400  four

## Setting

Setting a new column automatically aligns the data by the indexes

In [43]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))

In [44]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [45]:
df['F'] = s1

Setting values by label

In [46]:
df.at[dates[0],'A'] = 0

Settomg values by position

In [47]:
df.iat[0,1] = 0

Setting by assigning with a numpy array

In [48]:
df.loc[:,'D'] = np.array([5] * len(df))

The result of the prior setting operations

In [49]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.140508  5  NaN
2013-01-02 -1.347553  0.565707  0.411916  5  1.0
2013-01-03 -0.203716 -1.693033 -0.382789  5  2.0
2013-01-04  0.260699 -0.769324  1.209948  5  3.0
2013-01-05 -0.324262 -0.304008  0.282900  5  4.0
2013-01-06 -1.316322  0.286291 -0.295967  5  5.0

A where operation with setting.

In [50]:
df2 = df.copy()

In [51]:
df2[df2 > 0] = -df2

In [52]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.140508 -5  NaN
2013-01-02 -1.347553 -0.565707 -0.411916 -5 -1.0
2013-01-03 -0.203716 -1.693033 -0.382789 -5 -2.0
2013-01-04 -0.260699 -0.769324 -1.209948 -5 -3.0
2013-01-05 -0.324262 -0.304008 -0.282900 -5 -4.0
2013-01-06 -1.316322 -0.286291 -0.295967 -5 -5.0

## Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [53]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [54]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [55]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.140508  5  NaN  1.0
2013-01-02 -1.347553  0.565707  0.411916  5  1.0  1.0
2013-01-03 -0.203716 -1.693033 -0.382789  5  2.0  NaN
2013-01-04  0.260699 -0.769324  1.209948  5  3.0  NaN

To drop any rows that have missing data.

In [56]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -1.347553  0.565707  0.411916  5  1.0  1.0

Filling missing data

In [57]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.140508  5  5.0  1.0
2013-01-02 -1.347553  0.565707  0.411916  5  1.0  1.0
2013-01-03 -0.203716 -1.693033 -0.382789  5  2.0  5.0
2013-01-04  0.260699 -0.769324  1.209948  5  3.0  5.0

To get the boolean mask where values are nan

In [58]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

See the [Basic section on Binary Ops](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop)

### Stats

Operations in general exclude missing data.

Performing a descriptive statistic

In [59]:
df.mean()

A   -0.488526
B   -0.319061
C    0.180917
D    5.000000
F    3.000000
dtype: float64

Same operation on the other axis

In [60]:
df.mean(1)

2013-01-01    1.214873
2013-01-02    1.126014
2013-01-03    0.944092
2013-01-04    1.740265
2013-01-05    1.730926
2013-01-06    1.734801
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [61]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [62]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [63]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.203716 -2.693033 -1.382789  4.0  1.0
2013-01-04 -2.739301 -3.769324 -1.790052  2.0  0.0
2013-01-05 -5.324262 -5.304008 -4.717100  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply

Applying functions to the data

In [64]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.140508   5   NaN
2013-01-02 -1.347553  0.565707  0.271408  10   1.0
2013-01-03 -1.551268 -1.127326 -0.111381  15   3.0
2013-01-04 -1.290570 -1.896650  1.098567  20   6.0
2013-01-05 -1.614831 -2.200659  1.381467  25  10.0
2013-01-06 -2.931153 -1.914367  1.085500  30  15.0

In [65]:
df.apply(lambda x: x.max() - x.min())

A    1.608251
B    2.258741
C    1.592737
D    0.000000
F    4.000000
dtype: float64

### Histogramming

See more at [Histogramming and Discretization](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization)

In [66]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [67]:
s

0    3
1    1
2    6
3    0
4    0
5    3
6    2
7    3
8    6
9    2
dtype: int32

In [68]:
s.value_counts()

3    3
6    2
2    2
0    2
1    1
dtype: int64

### String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses [regular expressions](https://docs.python.org/2/library/re.html) by default (and in some cases always uses them). See more at [Vectorized String Methods](http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods).

In [70]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [71]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

### Concat

pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the [Merging section](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging)

Concatenating pandas objects together with concat():

In [72]:
df = pd.DataFrame(np.random.randn(10, 4))

In [73]:
df

          0         1         2         3
0  0.484182  0.074726  0.209719 -1.919695
1  0.005804 -1.065861 -0.049156  0.620008
2 -1.269387 -0.627888 -1.110300 -1.724359
3  0.585904  0.047676 -0.143252 -0.375839
4 -0.673923 -0.759218  1.333071  2.361188
5  0.750859  0.109638 -0.753956  0.721703
6 -1.610125 -3.147348 -1.133287 -0.479462
7  0.921930  2.400726 -0.886250  0.506440
8 -0.031873 -0.600725 -0.121611  1.308387
9 -0.493726 -0.778701  0.218224  0.509627

In [76]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.484182  0.074726  0.209719 -1.919695
 1  0.005804 -1.065861 -0.049156  0.620008
 2 -1.269387 -0.627888 -1.110300 -1.724359,
           0         1         2         3
 3  0.585904  0.047676 -0.143252 -0.375839
 4 -0.673923 -0.759218  1.333071  2.361188
 5  0.750859  0.109638 -0.753956  0.721703
 6 -1.610125 -3.147348 -1.133287 -0.479462,
           0         1         2         3
 7  0.921930  2.400726 -0.886250  0.506440
 8 -0.031873 -0.600725 -0.121611  1.308387
 9 -0.493726 -0.778701  0.218224  0.509627]

In [75]:
pd.concat(pieces)

          0         1         2         3
0  0.484182  0.074726  0.209719 -1.919695
1  0.005804 -1.065861 -0.049156  0.620008
2 -1.269387 -0.627888 -1.110300 -1.724359
3  0.585904  0.047676 -0.143252 -0.375839
4 -0.673923 -0.759218  1.333071  2.361188
5  0.750859  0.109638 -0.753956  0.721703
6 -1.610125 -3.147348 -1.133287 -0.479462
7  0.921930  2.400726 -0.886250  0.506440
8 -0.031873 -0.600725 -0.121611  1.308387
9 -0.493726 -0.778701  0.218224  0.509627

### Join

SQL style merges. See the [Database style joining](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [77]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [78]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [79]:
left

   key  lval
0  foo     1
1  foo     2

In [80]:
right

   key  rval
0  foo     4
1  foo     5

In [81]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### Append

Append rows to a dataframe. See the [Appending](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [82]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [83]:
df

          A         B         C         D
0  1.122949 -2.956838  0.854432 -0.429782
1  2.232380 -0.686893  1.948284 -1.451533
2 -1.612112  0.219931 -1.324008  0.840269
3  1.471846  0.193089 -0.031849 -0.620457
4 -0.031822 -0.548531  0.652601 -0.278356
5 -0.172977 -1.029382  0.349754  0.262812
6 -0.125931  0.658972 -1.018029  1.219361
7  0.777440 -1.185287 -0.237293 -0.145175

In [84]:
s = df.iloc[3]

In [85]:
df.append(s, ignore_index=True)

          A         B         C         D
0  1.122949 -2.956838  0.854432 -0.429782
1  2.232380 -0.686893  1.948284 -1.451533
2 -1.612112  0.219931 -1.324008  0.840269
3  1.471846  0.193089 -0.031849 -0.620457
4 -0.031822 -0.548531  0.652601 -0.278356
5 -0.172977 -1.029382  0.349754  0.262812
6 -0.125931  0.658972 -1.018029  1.219361
7  0.777440 -1.185287 -0.237293 -0.145175
8  1.471846  0.193089 -0.031849 -0.620457

## Grouping

By “group by” we are referring to a process involving one or more of the following steps

* **Splitting** the data into groups based on some criteria
* **Applying** a function to each group independently
* **Combining** the results into a data structure

See the [Grouping section](http://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

In [86]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                                    'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                                    'C' : np.random.randn(8),
                                     'D' : np.random.randn(8)})

In [87]:
df

     A      B         C         D
0  foo    one -1.064207  1.152996
1  bar    one  0.485853 -0.733576
2  foo    two  1.626852 -1.636311
3  bar  three -1.052470  0.368346
4  foo    two  0.887368  0.775929
5  bar    two -1.206150  0.928351
6  foo    one  0.046369 -0.167346
7  foo  three -0.297889  0.020249

Grouping and then applying a function sum to the resulting groups.

In [88]:
df.groupby('A').sum()

            C         D
A
bar -1.772767  0.563121
foo  1.198493  0.145517

In [89]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.485853 -0.733576
    three -1.052470  0.368346
    two   -1.206150  0.928351
foo one   -1.017838  0.985650
    three -0.297889  0.020249
    two    2.514220 -0.860382

## Reshaping

See the sections on [Hierarchical Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical) and [Reshaping](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking).

### Stack

In [90]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                                ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))

In [91]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [92]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [93]:
df2 = df[:4]

In [94]:
df2

                     A         B
first second
bar   one     0.886665  0.032684
      two    -1.747632 -0.811557
baz   one     0.902581 -0.894489
      two    -0.868108 -0.247741

The stack() method “compresses” a level in the DataFrame’s columns.

In [95]:
stacked = df2.stack()

In [96]:
stacked

first  second
bar    one     A    0.886665
               B    0.032684
       two     A   -1.747632
               B   -0.811557
baz    one     A    0.902581
               B   -0.894489
       two     A   -0.868108
               B   -0.247741
dtype: float64

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the **last level**:

In [97]:
stacked.unstack()

                     A         B
first second
bar   one     0.886665  0.032684
      two    -1.747632 -0.811557
baz   one     0.902581 -0.894489
      two    -0.868108 -0.247741

In [98]:
stacked.unstack(1)

second        one       two
first
bar   A  0.886665 -1.747632
      B  0.032684 -0.811557
baz   A  0.902581 -0.868108
      B -0.894489 -0.247741

In [99]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.886665  0.902581
       B  0.032684 -0.894489
two    A -1.747632 -0.868108
       B -0.811557 -0.247741

### Pivot Tables

See the section on [Pivot Tables](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-pivot).

In [100]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                                    'B' : ['A', 'B', 'C'] * 4,
                                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                                    'D' : np.random.randn(12),
                                    'E' : np.random.randn(12)})

In [101]:
df

        A  B    C         D         E
0     one  A  foo  0.227271 -1.463787
1     one  B  foo -0.244311 -2.155679
2     two  C  foo  1.088610  1.576666
3   three  A  bar -1.658288  1.130341
4     one  B  bar -1.086576  0.678911
5     one  C  bar -1.091177 -0.512131
6     two  A  foo -1.690216 -0.049376
7   three  B  foo  1.202958 -0.067962
8     one  C  foo  0.105253  0.452726
9     one  A  bar -0.103170 -0.106259
10    two  B  bar  1.054280  1.763088
11  three  C  bar -0.984785  1.408672

We can produce pivot tables from this data very easily:

In [102]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.103170  0.227271
      B -1.086576 -0.244311
      C -1.091177  0.105253
three A -1.658288       NaN
      B       NaN  1.202958
      C -0.984785       NaN
two   A       NaN -1.690216
      B  1.054280       NaN
      C       NaN  1.088610

## Time Series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the [Time Series section](http://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries)

In [103]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [104]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [105]:
ts.resample('5Min').sum()

2012-01-01    22400
Freq: 5T, dtype: int32

Time zone representation

In [106]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [107]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [108]:
ts

2012-03-06    0.842772
2012-03-07    0.681200
2012-03-08    0.178840
2012-03-09   -0.061989
2012-03-10    0.607619
Freq: D, dtype: float64

In [109]:
ts_utc = ts.tz_localize('UTC')

In [110]:
ts_utc

2012-03-06 00:00:00+00:00    0.842772
2012-03-07 00:00:00+00:00    0.681200
2012-03-08 00:00:00+00:00    0.178840
2012-03-09 00:00:00+00:00   -0.061989
2012-03-10 00:00:00+00:00    0.607619
Freq: D, dtype: float64


Convert to another time zone

In [111]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.842772
2012-03-06 19:00:00-05:00    0.681200
2012-03-07 19:00:00-05:00    0.178840
2012-03-08 19:00:00-05:00   -0.061989
2012-03-09 19:00:00-05:00    0.607619
Freq: D, dtype: float64


Converting between time span representations

In [112]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [113]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [114]:
ts

2012-01-31   -1.864776
2012-02-29   -0.374038
2012-03-31    0.995631
2012-04-30   -0.009515
2012-05-31   -1.490773
Freq: M, dtype: float64

In [115]:
ps = ts.to_period()

In [116]:
ps

2012-01   -1.864776
2012-02   -0.374038
2012-03    0.995631
2012-04   -0.009515
2012-05   -1.490773
Freq: M, dtype: float64

In [117]:
ps.to_timestamp()

2012-01-01   -1.864776
2012-02-01   -0.374038
2012-03-01    0.995631
2012-04-01   -0.009515
2012-05-01   -1.490773
Freq: MS, dtype: float64

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [118]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [119]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [120]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [121]:
ts.head()

1990-03-01 09:00   -0.368159
1990-06-01 09:00   -0.808522
1990-09-01 09:00   -0.666185
1990-12-01 09:00   -2.519297
1991-03-01 09:00   -0.306901
Freq: H, dtype: float64

## Categoricals

Since version 0.15, pandas can include categorical data in a DataFrame. For full docs, see the [categorical introduction](http://pandas.pydata.org/pandas-docs/stable/categorical.html#categorical) and the [API documentation](http://pandas.pydata.org/pandas-docs/stable/api.html#api-categorical).

In [122]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

Convert the raw grades to a categorical data type.

In [123]:
df["grade"] = df["raw_grade"].astype("category")

In [124]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

Rename the categories to more meaningful names (assigning to Series.cat.categories is inplace!)

In [125]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

Reorder the categories and simultaneously add the missing categories (methods under Series .cat return a new Series per default).

In [126]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [127]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

Sorting is per order in the categories, not lexical order.

In [128]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

Grouping by a categorical column shows also empty categories.

In [129]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

## Getting Data In/Out

### CSV
[Writing to a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv)

In [133]:
df.to_csv('foo.csv')

[Reading from a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-read-csv-table)

In [134]:
pd.read_csv('foo.csv')

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad

### HDF5
Reading and writing to [HDFStores](http://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5)

Writing to a HDF5 Store

In [135]:
df.to_hdf('foo.h5','df')

NotImplementedError: Cannot store a category dtype in a HDF5 dataset that uses format="fixed". Use format="table".

Reading from a HDF5 Store

In [136]:
pd.read_hdf('foo.h5','df')

AttributeError: Attribute 'block2_items_variety' does not exist in node: '/df'

### Excel

Reading and writing to [MS Excel](http://pandas.pydata.org/pandas-docs/stable/io.html#io-excel)

Writing to an excel file

In [ ]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

Reading from an excel file

In [ ]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

### Gotchas
If you are trying an operation and you see an exception like:

In [ ]:
if pd.Series([False, True, False]):
    print("I was true")

See [Comparisons](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-compare) for an explanation and what to do.

See [Gotchas](http://pandas.pydata.org/pandas-docs/stable/gotchas.html#gotchas) as well.